#### Terraform Format and Style 🖌\`success\`
#### Terraform Initialization ⚙️\`success\`
#### Terraform Validation 🤖\`Success! The configuration is valid.

\`
#### Terraform Plan 📖\`success\`

<details><summary>Show Plan</summary>

\`\`\`\n
terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.eks_connection_security_group will be created
  + resource "aws_security_group" "eks_connection_security_group" {
      + arn                    = (known after apply)
      + description            = "Security Group to connect EKS with RDS"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "eks-connector-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0006532d857dc75e9"
    }

  # module.aws_ecr.aws_ecr_repository.ecr_repo will be created
  + resource "aws_ecr_repository" "ecr_repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "kittens-store"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.aws_eks.aws_eks_cluster.main will be created
  + resource "aws_eks_cluster" "main" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "main_eks_cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-03da1f92e9a03dd71",
              + "subnet-0864f2ae91165356f",
              + "subnet-0ef3483cb3e7876ff",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.aws_eks.aws_eks_node_group.eks_node_group will be created
  + resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "main_eks_cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "eks-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-03da1f92e9a03dd71",
          + "subnet-0864f2ae91165356f",
          + "subnet-0ef3483cb3e7876ff",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.aws_eks.aws_iam_role.eks_cluster_role will be created
  + resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Basic EKS role"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + path                  = "/"
      + tags                  = {
          + "tag-key" = "eks-cluster-role-tag"
        }
      + tags_all              = {
          + "tag-key" = "eks-cluster-role-tag"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.aws_eks.aws_iam_role.eks_node_role will be created
  + resource "aws_iam_role" "eks_node_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Basic EKS node role"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-node-role"
      + path                  = "/"
      + tags                  = {
          + "tag-key" = "eks-node-role-tag"
        }
      + tags_all              = {
          + "tag-key" = "eks-node-role-tag"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.aws_eks.aws_iam_role_policy_attachment.cluster-AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "cluster-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # module.aws_eks.aws_iam_role_policy_attachment.cluster-AmazonEKSServicePolicy will be created
  + resource "aws_iam_role_policy_attachment" "cluster-AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "eks-cluster-role"
    }

  # module.aws_eks.aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-node-role"
    }

  # module.aws_eks.aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-node-role"
    }

  # module.aws_eks.aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-node-role"
    }

  # module.aws_eks.aws_launch_template.eks_node_template will be created
  + resource "aws_launch_template" "eks_node_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + instance_type   = "t3.medium"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "kittens"
      + tags_all        = (known after apply)

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interfaces {
          + security_groups = (known after apply)
        }
    }

  # module.aws_eks.aws_security_group.eks_security_group will be created
  + resource "aws_security_group" "eks_security_group" {
      + arn                    = (known after apply)
      + description            = "A security group to connect via kubectl"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPs from outside world"
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "eks-connector-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "eks-connector-sg"
        }
      + tags_all               = {
          + "Name" = "eks-connector-sg"
        }
      + vpc_id                 = "vpc-0006532d857dc75e9"
    }

  # module.aws_eks.aws_security_group.worker_group will be created
  + resource "aws_security_group" "worker_group" {
      + arn                    = (known after apply)
      + description            = "For EKS worker kittens"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "all for cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "kittens_worker"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "kubernetes.io/cluster/main_eks_cluster" = "shared"
        }
      + tags_all               = {
          + "kubernetes.io/cluster/main_eks_cluster" = "shared"
        }
      + vpc_id                 = "vpc-0006532d857dc75e9"
    }

  # module.aws_rds.aws_db_instance.default will be created
  + resource "aws_db_instance" "default" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "13.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = "kittensdb-"
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "kittensdb"
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "postgres_user"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.aws_rds.aws_db_subnet_group.default will be created
  + resource "aws_db_subnet_group" "default" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "kittensdb-subnetgroup-"
      + subnet_ids  = [
          + "subnet-03da1f92e9a03dd71",
          + "subnet-0864f2ae91165356f",
          + "subnet-0ef3483cb3e7876ff",
        ]
      + tags        = {
          + "Name" = "My DB subnet group"
        }
      + tags_all    = {
          + "Name" = "My DB subnet group"
        }
    }

  # module.aws_rds.aws_security_group.connection_security_group will be created
  + resource "aws_security_group" "connection_security_group" {
      + arn                    = (known after apply)
      + description            = "Connection Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "kittensdb-db-connector-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "kittensdb_connection_security_group"
        }
      + tags_all               = {
          + "Name" = "kittensdb_connection_security_group"
        }
      + vpc_id                 = "vpc-0006532d857dc75e9"
    }

  # module.aws_rds.aws_security_group.security_group_db will be created
  + resource "aws_security_group" "security_group_db" {
      + arn                    = (known after apply)
      + description            = "Allows DB connection to security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "DB Connection"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "kittensdb-sg-db-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "kittensdb_db_security_group"
        }
      + tags_all               = {
          + "Name" = "kittensdb_db_security_group"
        }
      + vpc_id                 = "vpc-0006532d857dc75e9"
    }

  # module.aws_rds.random_password.password will be created
  + resource "random_password" "password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + database_url              = (sensitive value)
  + eks_certificate_authority = (sensitive value)
  + eks_cluster_endpoint      = (known after apply)
  + eks_cluster_name          = "main_eks_cluster"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

\`\`\`

</details>

*Pusher: @vbyno, Action: \`push\`, Working Directory: \`\`, Workflow: \`kittens-action\`*